import sys
sys.stdin = open('input.txt')
# 대칭이라면 K라고 해보자.
# 대칭이 아니면 M이라고 해보자.
# 1: ( or ) 불가능
# 2: () 1가지, K=1
# 3: 불가능
# 4: ()() (()) 2가지, K=2, M=0
# 6: ()()() (()()) / (())() ()(()) ((())) 2+(K-1)*3가지, K=3, M=2
# 8: ()()()() (()()())|((()())) ()(()()) (()())()|(())()() ((())())|()()(()) ()(())() (()(()))|(((()))) ()((())) ((()))()
# 2+(K-1)*3+(2*M)+1
# 다음 K는 이전 K+1 + M//2
# 10: 2+3+3+3+3 = 2+3*4 = 14가지
# 12: 2+3*13 = 41가지
# 재귀적으로 구성 가능..대신 방문처리를 하자!
def solution(L):
    visited = [0]*5001
    visited[2] = 1
    visited[4] = 2
    if L > 4:
        i = 4
        while i < L:
            visited[i+2] = 2+(visited[i]-1)*3
            i += 2
    return visited[L]

T = int(input())
for tc in range(1, T+1):
    L = int(input())
    print(solution(L) % 1000000007)